-- Write your PostgreSQL query statement below
-- Хүснэгт: Scores
-- Баганын нэр	Төрөл
-- id	int
-- score	decimal
--     id нь энэ хүснэгтийн үндсэн түлхүүр (үл давхцах утгатай багана) юм.
--     Энэ хүснэгтийн мөр бүрт тоглоомын оноо хадгалагдана. Оноо нь таслалаас хойш хоёр оронтой аравтын бутархай тоо байна.

-- Даалгавар:
-- Оноонуудын эрэмбийг (rank) олох шийдэл бичнэ үү. Эрэмбийг дараах дүрмийн дагуу тооцно:
--     Оноонуудыг хамгийн ихээс нь хамгийн бага руу эрэмбэлнэ.
--     Хэрэв хоёр оноо тэнцүү байвал хоёуланд нь ижил эрэмбэ онооно.
--     Оноо тэнцсэний дараагийн эрэмбэ нь шууд залгамжлах бүхэл тоо байна. Өөрөөр хэлбэл, эрэмбүүдийн хооронд тооны алгасал (завсар) байх ёсгүй.
--     Үр дүнгийн хүснэгтийг оноогоор нь ихээс бага руу эрэмбэлж буцаана уу.

-- Жишээ: Хэрэв оноонууд 4.0, 4.0, 3.5 гэж байвал:

--     4.0 -> 1-р эрэмбэ
--     4.0 -> 1-р эрэмбэ
--     3.5 -> 2-р эрэмбэ (1-ийн дараа шууд 2 орж байна)

select
    s.score,
    dense_rank() over (order by s.score desc) as rank
from scores s;


-- SELECT
--   product_name,
--   category,
--   units_sold,
--   RANK() OVER (PARTITION BY category ORDER BY units_sold DESC) AS rank_in_category
-- FROM
--   product_sales;
